app/controllers/articles_controller.rb

     def index

        @articles = Article.order("RANDOM()").limit(5)
---
SELECT  "articles".* FROM "articles" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 5]]